'''
Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в один рядок через кому.
Отримайте для масиву середнє арифметичне.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
while True:
    A = np.zeros(5, dtype=int)  # ініціалізуємо одновимірний масив нулями розміром 5
    for i in range(5):  # циклічно заповнюємо масив елементами, отриманими з клавіатрури
        while True:
            try:  # перевіряємо, що користувач вводить лише цифри
                A[i] = int(input(f'A[{i + 1}] = '))
                break
            except ValueError:
                print('It is not a number. Try again')
    for i in range(5):
        # циклічно виводимо елементи масиву через кому і врахуємо, що після останнього елемента не буде ставитися кома
        print(f'{A[i]}, ' if i != 4 else A[i], end='')

    arithmetic = sum(A) / 5  # обраховуємо середнє арифметичне: додамо всі елементи і потім розділимо на їх кількість
    print('\n'f'Arithmetic mean = {arithmetic}')

    answer = input('Бажаєте продовжити (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
