'''
Дані про температуру повітря за декаду листопада зберігаються в масиві.
Визначити, скільки разів температура опускалася нижче -10 градусів.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
# створюємо масив зі списку значень температури за декаду листопада (декада місяця - 10 днів)
T = np.array([5, -8, -6, -12, -11, -5, 0, 2, -4, -10])
count = 0     # вводимо зміну-лічильник для фіксування випадків, коли температура опускатиметься нижче -10
for i in range(10):     # циклічно обходимо усі елементи масиву
    if T[i] < -10:      # якщо знайдено значення менше -10, збільшуємо лічильник на 1
        count += 1

print(f'{count} рази температура опускалася нижче -10 градусів')
