'''
Створіть масив з 15 цілочисельних елементів і визначте серед них мінімальне значення.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    T = np.zeros(15, dtype=int)     # ініціалізуємо масив нулями розміром 15
    for i in range(15):     # циклічно заповнюємо масив випадковими числами в межах від -10 до 10
        T[i] = randint(-10, 10)
    # виводимо масив і мінімальний елемент масиву за допомогою функції min()
    print(f'{T} \nMin element: {min(T)}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
