'''
Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np    # імпортуємо бібліотеку numpy для роботи з масивами
A = np.zeros(10)      # ініціалізуємо масив нулями розміром 10
t = 1     # перше значення для температури
# використаємо формулу для вільного падіння: h = g * t**2 / 2 (ля Землі g = 9.8)
for i in range(10):     # циклічно заповнюємо масив за допомогою формули
    A[i] = 9.8 * t**2 / 2
    t += 1     # збільшуємо значення температури для наступної ітерації

print(A)
