'''
Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність масиву - 15.
Заповнення масиву здійснити випадковими числами від 10 до 50.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(15, dtype=int)     # ініціалізуємо масив нулями розміром 15
    # вводимо змінну prod для обрахунку добутку елементів масиву, які кратні 7
    # вводимо змінну flag, щоб зафіксувати, чи знайдено хоча б один елемент кратний 7
    prod, flag = 1, False
    for i in range(15):     # циклічно заповнюємо масив випадковими числами в межах від 10 до 50
        A[i] = randint(10, 50)
        if A[i] % 7 == 0:    # перевірка чи остача від ділення на 7 дорівнює 0
            prod *= A[i]     # якщо елемент задовільняє умову, то домножуємо його в змінну prod
            flag = True      # змінюємо прапорець, що знайдено принаймі один елемент кратний 7
    # якщо flag = True, то виводимо добуток, якщо прапорець не змінився, то не знайдено жодного елемента кратного 7
    print(A, f'\nДобуток чисел, які кратні 7 = {prod}' if flag == True else '\nУ масиві відсутні числа кратні 7')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
