'''
Знайти суму елементів масиву дійсних чисел, що мають непарні номери. Розмірність масиву - 20.
Заповнення масиву здійснити випадковими числами від 100 до 200.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(20, dtype=int)     # ініціалізуємо масив нулями розміром 20
    for i in range(20):     # циклічно заповнюємо масив випадковими числами в межах від 100 до 200
        A[i] = randint(100, 200)
    print(A)
    sum = 0     # вводимо зміну для обрахунку суми елементів, що мають непарний номер
    for i in range(1, 20, 2):     # циклічно обходимо елементи з непарними номерами і додаємо їх
        sum += A[i]
    print(f'Сума елементів, що мають непрні номери = {sum}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
