'''
Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність масиву - 10.
Заповнення масиву здійснити за допомогою клавіатури.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
while True:
    A = np.zeros(10, dtype=int)     # ініціалізуємо масив нулями розміром 10
    for i in range(10):     # циклічно заповнюємо масив елементами, отриманими з клавіатури
        while True:
            try:     # первірка на правильність введення даних користувачем
                A[i] = int(input(f'A[{i + 1}] = '))
                break
            except ValueError:
                print('Це не число. Спробуйте ще раз')
    # вводимо змінну prod для обрахунку добутку елементів масиву, які менші за 0
    # вводимо змінну flag, щоб зафіксувати, чи знайдено хоча б один елемент менший за 0
    prod, flag = 1, False
    for j in range(10):  # циклічно обходимо всі елементи масиву
        if A[j] < 0:     # якщо елемент задовільняє умову, то домножуємо його в змінну prod
            prod *= A[j]
            flag = True     # змінюємо прапорець, що знайдено принаймі один елемент менший 0
    print(A, f'\nДобуток елементів, менших за 0 = {prod}' if flag == True else '\nУ масиві відсутні від`ємні елементи')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
