'''
Знайти суму всіх елементів масиву цілих чисел що задовольняють умові: остача від ділення на 2 дорівнює 3.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 200 до 300.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(20, dtype=int)     # ініціалізуємо масив нулями розміром 20
    sum = 0     # вводимо зміну для обрахунку суми елементів, що задовільняють умову
    for i in range(20):     # циклічно заповнюємо масив випадковими числами в межах від 200 до 300
        A[i] = randint(200, 300)
        if A[i] % 2 == 3:   # перевірка чи остача від ділення на 2 дорівнює 3
            sum += A[i]     # якщо елемент завільняє умову, то додаємо його в змінну sum
    print(f'{A} \nCума елементів масиву, у яких остача від ділення на 2 дорівнює 3: {sum}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
