'''
Знайти суму всіх елементів масиву дійсних чисел, більших за задане число. Розмірність масиву - 20.
Заповнення масиву здійснити випадковими числами від 50 до 100.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    while True:
        try:     # первірка на правильність введення даних користувачем
            X = int(input('Введіть число: '))
            break
        except ValueError:
            print('Це не число. Спробуйте ще раз')
    A = np.zeros(20, dtype=int)     # ініціалізуємо масив нулями розміром 20
    sum = 0     # вводимо зміну для обрахунку суми елементів, що більші за задане число користувачем
    for i in range(20):     # циклічно заповнюємо масив випадковими числами в межах від 50 до 100
        A[i] = randint(50, 100)
        if A[i] > X:     # якщо елемент задовільняє умову, то додаємо в змінну sum
            sum += A[i]
    print(f'{A} \nCума елементів, які більші за число {X} = {sum}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
