'''
Знайти добуток всіх елементів масиву дійсних чисел, менших заданого числа. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 50 до 100.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    while True:
        try:     # первірка на правильність введення даних користувачем
            X = int(input('Введіть число: '))
            break
        except ValueError:
            print('Це не число. Спробуйте ще раз')
    # вводимо зміну prod для обрахунку добутку елементів, що менші за задане число користувачем
    # вводимо змінну flag щоб визначити чи хоча б одне число, що менше за задане число, і повідомити про це користувача
    prod, flag = 1, False
    A = np.zeros(10, dtype=int)     # ініціалізуємо масив нулями розміром 20
    for i in range(10):     # циклічно заповнюємо масив випадковими числами в межах від 50 до 100
        A[i] = randint(50, 100)
        if A[i] < X:      # якщо знайдений елемент, що менший за задане число
            prod *= A[i]  # домножуємо цей елемент в змінну prod
            flag = True   # змінюємо прапорець, що знайдено хоча б один елемент, що менший за задане число
    # виводимо результат, зважаючи на змінну flag (чи знайдено хоча б один елемент, що задовільняє умову)
    print(A, f'\nДобуток елементів, які менші за число {X} = {prod}' if flag == True else
    f'\nУ масиві відсутні елементів, які менші за число {X}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break