'''
Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 5 до 500.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(10, dtype=int)     # ініціалізуємо масив нулями розміром 10
    prod, flag = 1, False
    for i in range(10):     # циклічно заповнюємо масив випадковими числами в межах від 5 до 500
        A[i] = randint(5, 500)
        if A[i] % 3 == 0 and A[i] % 9 == 0:     # якщо елемент задовільняє умову, то додаємо в змінну sum
            prod *= A[i]
            flag = True     # змінюємо прапорець, що знайдено хоча б один елемент, що кратний 3 і 9
    # виводимо результат, зважаючи на змінну flag (чи знайдено хоча б один елемент, що задовільняє умову)
    print(A, f'\nДобуток елементів, кратних 3 і 9 = {prod}' if flag == True else
    f'\nУ масиві відсутні елементи кратні 3 і 9')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break