'''
Знайти суму всіх елементів масиву цілих чисел, які менше середнього арифметичного елементів масиву.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 150 до 300.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(20, dtype=int)     # ініціалізуємо масив нулями розміром 20
    for i in range(20):     # циклічно заповнюємо масив випадковими числами в межах від 5 до 500
        A[i] = randint(150, 300)
    arithm = sum(A) / 20    # обраховуємо середнє арифметичне, додавши всі елементи масиву і розділивши на їх кількість
    summ = 0     # вводимо зміну для обрахунку суми елементів, які менші середнього арифметичного елементів масиву
    for j in range(20):     # циклічно обходимо всі елементи масиву
        if A[j] < arithm:   # якщо значення елемента задовільняє умову, то додаємо його у змінну sum
            summ += A[j]
    print(f'{A} \nСума елементів, які менші середнього арифметичного елементів масиву = {summ}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break