'''
Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8 одночасно. Розмірність масиву - 30.
Заповнення масиву здійснити випадковими числами від 500 до 1000.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(30, dtype=int)     # ініціалізуємо масив нулями розміром 20
    sum = 0     # вводимо зміну для обрахунку суми елементів, які діляться на 5 і на 8 одночасно
    for i in range(30):     # циклічно заповнюємо масив випадковими числами в межах від 500 до 1000
        A[i] = randint(500, 1000)
        if A[i] % 5 == 0 and A[i] % 8 == 0:   # перевіряємо чи остача від ділення на 5 і на 8 дорівнює 0
            sum += A[i]     # якщо значення елементу задовільняє умову, то додаєсо це значення в змінну sum
    print(f'{A} \nСума елементів, які які діляться на 5 і на 8 одночасно = {sum}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break