'''
Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 10 до 100.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(10, dtype=int)     # ініціалізуємо масив нулями розміром 10
    # вводимо зміну prod для обрахунку добутку елементів, які кратні 5
    # вводимо змінну flag щоб визначити чи хоча б є одне число кратне 5, і повідомити про це користувача
    prod, flag = 1, False
    for i in range(10):     # циклічно заповнюємо масив випадковими числами в межах від 5 до 500
        A[i] = randint(10, 100)
        if A[i] % 5 == 0:   # перевіряємо чи остача від ділення на 5 дорівнює 0
            prod *= A[i]    # якщо значення елемента задовільняє умову, то домножуємо це значення в змінну prod
            flag = True     # змінюємо прапорець, що знайдено хоча б один елемент, що кратний 5
    # виводимо результат, зважаючи на змінну flag (чи знайдено хоча б один елемент, що задовільняє умову)
    print(A, f'\nДобуток елементів,які кратні 5 = {prod}' if flag == True else
    f'\nУ масиві відсутні елементи, які кратні 5')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break