'''
Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне.
Заміри температури виробляються шість раз на добу і результати вводяться з клавіатури у масив T.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
while True:
    T = np.zeros(6)     # ініціалізуємо масив нулями розміром 20
    for i in range(6):  # циклічно заповнюємо масив елементами, отриманимим з клавіатури
        while True:
            try:     # перевіряємо правильність введення даних з клавіатури
                T[i] = float(input(f'T{i + 1} - '))
                break
            except ValueError:
                print('It is not a number')
    # arithm_mean - визначаємо середнє арифметичне, додаючи всі елементи масиву і розділивши на їх кількість
    # min_val, max_val - визначаємо мінімальний та максииальний елемент у масиві за допомогою функцій min() та max()
    arithm_mean, min_val, max_val = sum(T) / 6, min(T), max(T)
    print(f'Мінімальна температура: {min_val} \nМаксимальна температура: {max_val} '
          f'\nСереднє значення температури за добу: {arithm_mean}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break