'''
Лінійний масив містить відомості про кількість опадів, що випали за кожен з 12 місяців одного року.
Складіть програму, що визначає загальну кількість опадів протягом цього року, середньомісячну кількість опадів,
кількість посушливих місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from enum import Enum  # імпортуємо модуль Enum для створення класу переліків
# створюємо клас month(Enum), де назвам місяців відповідають індекси в масиві,
# щоб потім вивести назву найпосушливішого місяця
class month(Enum):
    Січень = 0
    Лютий = 1
    Березень = 2
    Квітень = 3
    Травень = 4
    Червень = 5
    Липень = 6
    Серпень = 7
    Вересень = 8
    Жовтень = 9
    Листопад = 10
    Грудень = 11
F = np.array([48, 43, 29, 27, 34, 37, 48, 53, 57, 48, 39, 29])  # створюємо масив зі списку значень опадів
# total_mean - визначаємо загальну кількість опадів, додавши всі елементи масиву за допомогою фінкції sum()
# arithm_mean -визначаємо середньомісячну кількість опадів, додаючи всі елементи масиву і розділивши на їх кількість
total_mean, arithm_mean = sum(F), sum(F) / 12
# вводимо змінну count для обрахунку посушливих місяців
# вводимо змінну min_val для запису мінімального значення, припускаємо що мінімальний елемент - перший
# вводимо змінну min_index для запису індекса мінімального значення, припускаємо, що індекс мінімального елемента - 0
count, min_val, min_index = 0, F[0], 0
for i in range(12):    # циклічно обходимо всі елементи масиву
    if F[i] <= 30:     # обраховуємо, скільки місяців було посушливих (коли кількість опадів була менше 30 мм)
        count += 1     # якщо значення елемента задовільняє умову, збільшуємо змінну count на одиницю
    if F[i] < min_val:  # перевіряємо, чи не є елемент меншим за елемент, який є мінімальним за попереднім припущенням
        min_val, min_index = F[i], i  # якщо значення задовільняє умову, то змінюємо значення min_val та min_index

print(f'Загальна кількість опадів протягом цього року: {total_mean} мм'
      f'\nСередньомісячна кількість опадів: {arithm_mean} мм'
      f'\nКількість посушливих місяців: {count} \nНайпосушливіший місяць року: {month(min_index).name}, {min_val} мм')
