'''
Знайти кількість парних елементів одновимірного масиву.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)     # ініціалізуємо масив нулями розміром N
    for i in range(N):     # циклічно заповнюємо масив випадковими числами в межах від -20 до 20
        A[i] = randint(-20, 20)
    print(A)
    count = 0     # вводимо зміну-лічильник для підрахунку кількості парних елементів
    for j in range(N):     # циклічно обходимо всі елементи масиву
        if A[j] % 2 == 0:  # перевіряємо, якщо остача від ділення дорівнює 0, то елемент парний
            count += 1     # якщо значення елемента задовільняє умову, то збільшуємо count на одиницю
    # виводимо результат, зважаючи на змінну count (чи знайдено хоча б один елемент, що задовільняє умову)
    print(f'Кількіксть парних елементів: {count}' if count > 0 else f'У масиві відсутні парні елементи')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
