'''
Знайти кількість парних елементів одновимірного масиву до першого зустрінутого числа рівного наперед заданому числу а.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    a = randint(0, 10)  # визнвчаємо рандомно число а
    N = randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 0 до 10
        A[i] = randint(0, 10)
    print(A)
    # вводимо зміну count для обрахунку кількості парних елементів
    # вводимо змінну flag щоб визначити чи задане число а взагалі зустрічається у масиві
    count, flag = 0, False
    for j in range(N):    # циклічно обходимо всі елементи масиву
        if A[j] == a:     # первіряємо, чи відповідає елемент наперед заданому числу
            flag = True   # якщо умова спрацювала, то змінюємо прапорець, що знайдено наперед задане число
            break         # якщо умова спрацювала, виходимо з циклу
        if A[j] % 2 == 0:  # якщо перша умова не спрацювала, то перевіряємо, чи елемент парним
            count += 1     # якщо значення елементу задовільняє умову, збільшуємо count на одиницю
    if flag == True:   # якщо flag = True, це означає, що є наперед задане число в масиві
        print(f'Кількіксть парних елементів, що знаходяться перед першим елементом {a}: {count}')
    else:    # якщо flag != True, це означає, що наперед задане число не знайдено в масиві
        print(f'У масиві не зустрічається елемент {a}')


    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break