'''
Обчислити середнє арифметичне значення тих елементів одновимірного масиву,
які розташовані за першим по порядку мінімальним елементом.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = randint(10, 20)  # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від -20 до 20
        A[i] = randint(-15, 15)
    print(A)
    # вводимо зміну min_val для визначення значення мінімального елемнта в масиві за допомогою функції min()
    # вводимо зміну min_index для запису індексу першого знайденого мінімального елемента в масиві
    min_val, min_index = min(A), 0
    for i in range(N):   # циклічно обходимо всі елементи масиву, щоб знайти перший мінімальний елемент
        if A[i] == min_val:  # як тільки знайдено такий елемент, виходимо з циклу
            min_index = i    # у змінну присвоюємо індекс першого знайденого елемента
            break
    # вводимо зміну count для підрахунку кількості елементів, які розташовані за першим по порядку мінімальним елементом
    # вводимо зміну sum_val для обрахунку суми елементів, які розташовані за першим по порядку мінімальним елементом
    count, sum_val = 0, 0
    for j in range(min_index + 1, N):  # циклічно обходимо ті елементи, що знаходяться за першим мінімальним елементом
        sum_val += A[j]  # додаємо значення елементу в змінну sum_val
        count += 1       # збільшуємо змінну count на одиницю
    # щоб визначити середнє арифметичне, потрібно суму елементів розділити на кількість елементів
    # виводимо результат, зважаючи на змінну count (щоб уникнути ділення на 0)
    print(f'Середнє арифметичне значення елементів,які розташовані за елементом {min_val}: {sum_val / count}' if count > 0
          else f'Мінімальний елемент {min_val} знаходиться на останній позиції в масиві')


    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break