'''
Обчислити середнє арифметичне значення тих елементів одновимірного масиву, які потрапляють в інтервал від -2 до 10.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = randint(10, 20)  # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від -20 до 20
        A[i] = randint(-15, 15)
    print(A)
    # вводимо зміну-лічильник count для підрахунку кількості елементів, які потрапляють в інтервал від -2 до 10
    # вводимо зміну sum_val для обрахунку суми елементів, які потрапляють в інтервал від -2 до 10
    count, sum_val = 0, 0
    for i in range(N):  # циклічно обходимо всі елементи масиву
        if -2 <= A[i] <= 10:  # перевіряємо чи значення елементу потрапляє у інтервал від -2 до 10
            sum_val += A[i]  # додаємо значення елементу в змінну sum_val
            count += 1  # збільшуємо змінну count на одиницю
    # щоб визначити середнє арифметичне, потрібно суму елементів розділити на кількість елементів
    # виводимо результат, зважаючи на змінну count (щоб уникнути ділення на 0)
    print(f'Середнє арифметичне елементів масиву, які потрапляють в інтервал від -2 до 10: {sum_val / count}' if count > 0
        else f'Немає елементів у масиві, які потрапляють в інтервал від -2 до 10')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break