'''
Дано два лінійних масиву однакової розмірності. Скласти третій масив з добутку елементів перших двох масивів,
що стоять на місцях з однаковим індексом.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint
while True:
    N = randint(10, 20)     # визначаємо рандомно розмір масивів в межах від 10 до 20
    A, B = np.zeros(N, dtype=int), np.zeros(N, dtype=int)   # ініціалізуємо масиви нулями розміром N
    for i in range(N):     # циклічно заповнюємо масиви випадковими числами в межах від -10 до 10
        A[i], B[i] = randint(-10, 10), randint(-10, 10)
    print(A, B, sep='\n')
# використаємо функцію * для масивів, яка перемножує відповідні елементи двох масивів і записує результат у новий масив
    print(f'A * B = {A * B}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break