'''
Знайти суму додатніх елементів лінійного масиву цілих чисел. Розмірність масиву - 10.
Заповнення масиву здійснити з клавіатури.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
while True:
    A = np.zeros(10, dtype=int)     # ініціалізуємо масив нулями розміром 10
    for i in range(10):     # циклічно заповнюємо масив значеннями, отриманими з клавіатури
        while True:
            try:     # перевіряємо отримані дані на правильність
                A[i] = int(input(f'A[{i}] - '))
                break
            except ValueError:
                print('Це не число')
    print(A)
    sum_val = 0     # вводимо зміну sum_val для обрахунку суми додатніх елементів
    for j in range(10):     # циклічно обходимо всі елементи масиву і перевіряємо чи є вони додатніми
        if A[j] > 0:
            sum_val += A[j]   # додаємо елемент, який задовільняє умову, в змінну sum_val
    print(f'Сума додатніх елементів масиву: {sum_val}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break