'''
Дані про направлення вітру (північний, південний, східний, західний) і силі вітру за декаду листопада зберігаються
в масиві. Визначити, скільки днів дув південний вітер з силою, що перевищує 8 м/с.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
# створюємо масиви зі списків направлень вітру (A) та силою вітру (B) за декаду листопада (декада місяця - 10 днів)
A, B = np.array(['пн', 'пд', 'пн', 'сх', 'сх', 'пд', 'зх', 'пд', 'сх', 'зх']), np.array([7, 10, 6, 9, 7, 12, 8, 6, 3, 4])
count = 0     # вводимо зміну-лічильник для фіксування днів, коли дув південний вітер з силою, що перевищує 8 м/с
for i in range(10):     # циклічно обходимо усі елементи масиву
    if A[i] == 'пд' and B[i] > 8:   # якщо значення з масивів A та B задовільняють умову
        count += 1                  # збільшуємо count на одиницю
print(f'Кількість днів, коли дув південний вітер з силою, що перевищує 8 м/с: {count}')