'''
Дані про температуру повітря і кількості опадів за декаду квітня зберігаються в масивах. Визначити кількість опадів,
що випали у вигляді дощу і у вигляді снігу за цю декаду.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
# створюємо масиви зі списків температури повітря (A) та кількості опадів (B) за декаду квітня (декада місяця - 10 днів)
# якщо температура повітря <= 0, то опади випадають у вигляді снігу, в інших випадках - у вигляді дощу
A, B = np.array([5, 0, -1, 3, 7, 8, 6, 0, 4, 5]), np.array([7, 3, 4, 9, 0, 4, 5, 0, 3, 4])
rain, snow = 0, 0     # вводимо змінні rain та snow, щоб обрахувати сумарну кількість опадів
for i in range(10):     # циклічно обходимо усі елементи масиву
    if A[i] <= 0:     # якщо температура відповідає значенням, коли випадає сніг
        snow += B[i]  # то додаємо в змінну snow кількість опадів
    else:
        rain += B[i]  # в іншому випадку додаємо в змінну rain кількість опадів

print(f'Кількість опадів у вигляді дощу: {rain} мм \nКількість опадів у вигляді снігу: {snow} мм')