'''
Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які починаються з певної букви, яка вводиться з клавіатури.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
A = np.array(['Осадча', 'Дзюбенко', 'Савченко', 'Кондратюк', 'Денисюк'])     # створюємо масив зі списку прізвищ
while True:
    while True:
        Letter = input('Введіть будь-яку букву алфавіту: ')  # отримуємо букву з клавіатури
        if len(Letter) == 1:  # перевіряємо, що користувач ввів лише одну букву
            break
        else:
            print('Введіть одну букву')
    flag = False  # водимо змінну, щоб визначити, чи буде хоча б одне співпадіння
    for i in range(5):
        # первіряємо чи ascii-код першої букви прізвища (великої чи маленької) співпадає з буквою, яку ввів користувач
        if ord(A[i][0]) == ord(Letter) or ord(A[i][0]) + 32 == ord(Letter):
            print(A[i])
            flag = True  # змінюємо прапорець, тому що знайдено принаймі один збіг
    if flag == False:  # якщо прапорець не змінився, отже не знайдено жодного збігу
        print(f'Жодне прізвище не починається на букву {Letter}')  # виводимо цю інформацію користувачу

    answer = input('Бажаєте продовжити (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
