'''
Підрахувати кількість елементів одновимірного масиву, для яких виконується нерівність i*i<ai<i!
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
import math     # імпортуємо бібліотеку math для роботи з математичними функціями
while True:
    N = randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 50 до 500
        A[i] = randint(50, 500)
    print(A)
    count = 0     # вводимо зміну count для обрахунку кількості елементів, що задовільняють умову i*i<ai<i!
    for j in range(N):    # циклічно обходимо всі елементи масиву
        if j*j < A[j] < math.factorial(j):   # перевіряємо, чи елемент задовільняє умову
            count += 1     # якщо значення елементу задовільняє умову, збільшуємо count на одиницю
    print(f'Кількість елементів, для яких виконується нерівність i*i<ai<i! : {count}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break