'''
Задано два натуральних числа a і b. Змінній w привласнити значення істина, якщо в одновимірному цілочисельному масиві
є хоча б один елемент, кратний а і не кратний b.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    a, b = randint(2, 11), randint(2, 11)    # визначаємо рандомно числа а та b
    N = randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від -50 до 50
        A[i] = randint(-50, 50)
    print(A)
    # вводимо змінну w, значення якої буде змінюватися, якщо є хоча б один елемент, кратний а і не кратний b
    w = False
    for j in range(N):    # циклічно обходимо всі елементи масиву
        if A[j] % a == 0 and A[j] % b != 0:   # перевіряємо, чи елемент кратний a і не кратний b
            w = True     # якщо умова спрацювала, то змінюємо w на True
    print(f'У масиві є хоча б один елемент, кратний {a} і не кратний {b}: {w}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break