'''
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи повторюється в цій таблиці назва першого товару,
і, якщо повторюється, видаліть назву першого товару з таблиці.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
import random     # імпортуємо функцію randint() для генерування випадкових чисел
# ініціалізуємо масив з назвами товарів, для випадкового заповнення вихідного масиву
L = np.array(['ruler', 'pencil', 'rubber', 'pen', 'globe', 'scissors', 'brush', 'paints', 'felt pens', 'glue', 'books'])
while True:
    N = random.randint(10, 15)   # визначаємо розмір масиву випадковим значенням у межах від 10 до 20
    A = np.random.choice(L, size=N)  # заповнюємо масив рандомними значення зі списку L розміром N
    print(A)
    count = 1  # вводимо змінну-лічильник, щоб визначити чи повторюється перший елемент умасиві
    for i in range(1, N):  # циклічно обходимо всі елементи масиву крім нульового
        if A[i] == A[0]:   # порівнюємо елементи з нульовим
            count += 1     # якщо умова спрацювала, збільшуємо count на одиницю
    if count > 1:     # якщо було знайдено повтори першого елемента у масиві, потрібно видалити перший елемент
        for i in range(N - 1):   # перезаписуємо всі елементи, починаючи з першого, на один вліво
            A[i] = A[i + 1]
        A.resize(N - 1)      # зменшуємо розмір масиву на один (видаляємо останній елемент)
    print(A)

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
