'''
Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки за ці послуги.
Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = 8    # визначаємо розмір масиву
    # створюємо масиви значень послуг та розцінок зі списків
    A = np.array(['Cut', 'Wash & cut', 'Restyle', 'Blow dry', 'Eyebrows', 'Pedicure', 'Manicure', 'Facial'])
    B = np.array([119, 130, 140, 110, 180, 280, 250, 300])
    G = randint(100, 300)     # визначаємо рандомно число G
    for i in range(len(A)):   # виводимо відповідні значення з масиву A(послуги) та масиву B(розцінка за послуги)
        print(f'{A[i]} - {B[i]}')
    index = []     # створюємо пустий список, куди будемо записувати індекси елементів, які потрібно видалити
    for j in range(N):    # циклічно обходимо всі елементи масиву B
        if B[j] < G:      # визначаємо чи ціна за послугу менша за задане число G
            index.append(j)     # додаємо індеск елемента, який задовільняє умову у список
    # вводимо змінну k, яка буде визначати на який інтервал перезаписувати елементи
    # вводимо змінну flag, щоб визначити, коли буде знайдено перший елемент, який повинен бути видалений
    k, flag = 1, False
    for i in range(len(A) - len(index)):   # циклічно обходимо ту кількість елементів, які повинні залишитися у масиві
        if i in index:   # якщо знайдено елемент, який потрібно видалити
            while True:  # перевіряється який елемент потрібно перезаписати на це місце, що повинен залишитися у масиві
                if B[i] == B[i + k] or i + k in index:
                    k += 1  # якщо наступний елемент теж повинен видалятися, то збільшуємо k а одинцю
                else:       # тобто збільшуємо інтервал перезаписування елементів
                    break
            A[i], B[i] = A[i + k], B[i + k]   # виконуємо заміну у обох масивах
            flag = True    # змінюємо значення flag на True, що було здійснено перезапис елемента
# якщо елемент не потрібно видаляти, а принаймі один перезапис був здійснений, то перезапис виконується на відстань k
        elif flag:
            A[i], B[i] = A[i + k], B[i + k]   # виконуємо заміну у обох масивах
    else:  # після закінчення циклу зменшуємо кількість елементів у масивах A та B на кількість видалених елементів
        A.resize(len(A) - len(index))
        B.resize(len(B) - len(index))
    print(f'Видаляємо послуги, що менші за {G}:')
    for i in range(len(A)):     # виводимо відповідні значення з масиву A(послуги) та масиву B(розцінка за послуги)
        print(f'{A[i]} - {B[i]}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
