'''
Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки за ці послуги.
Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = 8    # визначаємо розмір масиву
    # створюємо масиви значень послуг та розцінок зі списків
    A = np.array(['Cut', 'Wash & cut', 'Restyle', 'Blow dry', 'Eyebrows', 'Pedicure', 'Manicure', 'Facial'])
    B = np.array([119, 130, 140, 110, 180, 280, 250, 300])
    G = randint(100, 300)     # визначаємо рандомно число G
    for i in range(len(A)):   # виводимо відповідні значення з масиву A(послуги) та масиву B(розцінка за послуги)
        print(f'{A[i]} - {B[i]}')
    index = []     # створюємо пустий список, куди будемо записувати індекси елементів, які потрібно видалити
    for j in range(N):    # циклічно обходимо всі елементи масиву B
        if B[j] < G:      # визначаємо чи ціна за послугу менша за задане число G
            index.append(j)     # додаємо індеск елемента, який задовільняє умову у список
    A, B = list(A), list(B)  # перетворюємо масиви у списки, щоб можна було швидше видаляти елементи
    index.reverse()  # переставляємо індикси у списку у звортньому порядку, щоб видаляти елементи у зворотньому порядку
    for i in index:  # проходимо по індексам у зміненому списку index
        del A[i], B[i]   # видаляємо елементи з A та B за відповідним індексом
    print(f'Видаляємо послуги, що менші за {G}:')
    for i in range(len(A)):     # виводимо відповідні значення з A(послуги) та B(розцінка за послуги)
        print(f'{A[i]} - {B[i]}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
