'''
Створіть масив А [1..7] за допомогою генератора випадкових чисел і виведіть його на екран.
Збільште всі його елементи в 2 рази.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(7, dtype=int)  # ініціалізуємо одновимірний масив нулями розміром 7
    for i in range(7):
        A[i] = randint(0, 10)  # циклічно заповнюємо масив випадковими числами в межах від 0 до 10
    print(A)

    for j in range(7):  # циклічно збільшуємо кожен елемент масиву вдвічі
        A[j] = A[j] * 2
    print(A)

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
