'''
У лотереї розігрувалося 100 квитків. Таблиця містить 10 номерів виграшних квитків.
Перевірте, чи є квиток з номером N виграшним.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    n = 10   # визначаємо розмір масиву
    # A - масив з номерами виграшних квитків
    A = np.zeros(n, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(n):  # циклічно заповнюємо масив випадковими числами в межах від 100 до 200
        A[i] = randint(100, 200)     # номер квитка може бути в межах від 100 до 200
    N = randint(100, 200)   # рандомно визначаємо номер квитка N, який будемо перевіряти на виграш
    # перевірка чи входить номер квитка в номери виграшних квитків, якщо (N in A) - True, то квиток виграшний
    print(f'Квиток з номером N {N} є', 'виграшним' if N in A else 'невиграшним')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break