'''
Дан одновимірний масив а. Сформувати новий масив, який складається тільки з тих елементів масиву а, які перевищують
свій номер на 10. Якщо таких елементів немає, то видати повідомлення.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 0 до 20
        A[i] = randint(0, 20)
    print(A)
    B = np.array([], dtype=int)     # ініціалізуємо пустий масив
    count = 0    # вводимо зміну-лічильник для обрахунку кількості елементів, що задовільняють умову
    for j in range(N):    # циклічно обходимо всі елементи масиву
        if A[j] - j > 10:   # якщо елемент задовільняє умову
            count += 1      # то збільшуємо змінну count на одиницю
            B.resize(count)  # збільшуємо розмір масиву, щоб записати новий елемент
            B[count - 1] = A[j]  # записуємо в масив значення
    print(B if len(B) > 0 else f'Немає елементів, які перевищують свій номер на 10')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break