'''
Знайти найбільший елемент з елементів одновимірного масиву, що мають парний номер. Визначити, чи є він єдиним.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 0 до 20
        A[i] = randint(0, 20)
    print(A)
    max_even_numb = 0   # вводимо зміну, щоб записувати максимльний елемент з парним номером
    count = 0    # вводимо зміну-лічильник для обрахунку кількості елементів
    for j in range(0, N, 2):    # циклічно обходимо елементи масиву з парними номерами
        if A[j] % 2 == 0:   # якщо значення елементу є парним, то записуємо в змінну max_even_numb значення
            if A[j] > max_even_numb:
                max_even_numb = A[j]
    for i in range(N):  # циклічно обходимо всі елементи масиву
        if A[i] == max_even_numb:    # обрахуємо кількість елементів, що відповідають значенню max_even_numb
            count += 1
    print(f'Найбільший елемент, що має парний номер: {max_even_numb}. Кількість таких чисел у масиві: {count}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break