'''
В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи масиву так, щоб спочатку розташовувалися
всі нулі, потім все одиниці, а потім всі п'ятірки. Додаткового масиву не заводити.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
import random     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    n = random.randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(n, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(n):  # циклічно заповнюємо масив випадковими числами 0, 1 або 5
        A[i] = random.choice([0, 1, 5])
    print(A)
    # використаємо алгоритм сортування бульбашкою
    n, i = len(A), 0
    flag = True  # вводимо змінну flag, щоб завершити цикл, коли не буле здійснено жодного обміну
    while flag:
        flag = False
        for j in range(n - i - 1):
            if A[j] > A[j + 1]:
                A[j], A[j + 1] = A[j + 1], A[j]
                flag = True
        i += 1

    print(A)


    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break