'''
Введіть масив з 20 елементів і визначте, чи є в ньому елементи з однаковими значеннями.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = 20   # визначаємо розмір масиву
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від -100 до 100
        A[i] = randint(-100, 100)
    print(A)
    # у змінну unique записуємо масив, який складається з унікальних елементів масиву A
    unique = np.unique(A)
    # якщо довжина масиву А і масиву unique співпадає, то це означає що у масиві А не повторюються елементи
    print('У масиві немає елементів з однаковими значеннями' if len(A) == len(unique) else
          'У масиві є елементи з однаковими значеннями')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break