'''
У будинку, що складається з 30 квартир, переселити мешканців так, щоб мешканці першої квартири переїхали в тридцяту,
з тридцятого - в першу, з другої - в 29 і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = 30   # визначаємо розмір масиву
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 1 до 8
        A[i] = randint(1, 8)  # у квартирі може проживати від одного до восьми людей
    print(A)
    count = 0   # вводимо змінну count для обрахунку кількості квартир, де проживає більше 5 осіб
    for j in range(N):   # циклічно обходимо усі елементи масиву
        if A[j] > 5:     # визначаємо кількість квартир, де проживає більше 5 осіб
            count += 1
    print(f'Кількість квартир, в яких проживає більше 5 осіб: {count}')
    for i in range(N//2):  # циклічно обходимо половину елементів масиву
        A[i], A[N - i - 1] = A[N - i - 1], A[i]   # міняємо елементи перший і останній, другий та предостанній і т.д.
    print(f'Після переселення мешканців будинку: \n{A}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break