'''
Відомість на зарплату представлена як дві таблиці. Одна містить прізвища працівників цеху,
а друга - їх зарплату за поточний місяць. Знайдіть прізвище працівника, зарплата якого найменш відхиляється від
середньої зарплати всіх працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою заробітною
платою. Видаліть з відомості на зарплату відомості про працівника,зарплата якого мінімальна.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
import math     # імпортуємо бібліотеку math для роботи з математичними функціями
A = np.array(['Матеуш', 'Довгань', 'Попова', 'Цвігун', 'Луценко', 'Гнатюк', 'Гаєвська', 'Скакун', 'Шмиганівський', 'Гук'])
B = np.array([8400, 4500, 5600, 5900, 5300, 7100, 4500, 6900, 5900, 5400])
for i in range(len(A)):     # виводимо відповідні значення з масиву A(прізвище) та масиву B(заробітня плата)
    print(f'{A[i]} - {B[i]}')
# least_val - записується найменше відхилення (модуль числа math.fabs()) від середнього значення (np.mean())
# least_ind - змінна, в яку записується індекс значення least_val
least_val, least_ind = math.fabs(B.mean() - B[0]), 0
min_index = []     # створюємо пустий список, куди будемо записувати індекси елементів (мінімальна заробітна плата)
# змінні max_1 та max_2, куди будуть записуватися індекси двох максимальних чисел
max_1, max_2 = 0, 1
for i in range(10):  # циклічно обходимо всі елементи масиву B
    if math.fabs(B.mean(0) - B[i]) < least_val:  # визначаємо найменше відхилення зарплати від середнього значення
        least_val = math.fabs(B.mean() - B[i])
        least_ind = i

    if B[i] == min(B):  # визначаємо індекси мінімальних значень та записуємо їх у список, щоб потім видалити їх
        min_index.append(i)

    if i > 1:   # обходимо всі елементи крім нульового та першого
        if B[i] > B[max_1]:   # визначаємо два максимальних значення зарплати
            max_1 = i
        elif B[i] > B[max_2]:
            max_2 = i
print(f'\nЗарплата працівника {A[least_ind]} найменше відхиляється від середньої зарплати всіх працівників за поточний місяць')
print(f'Працівники з найбільшою заробітньою платою: {A[max_1]}, {A[max_2]}')

A, B = list(A), list(B)  # перетворюємо масиви у списки, щоб можна було швидше видаляти елементи
min_index.reverse()  # переставляємо індикси у списку у звортньому порядку, щоб видаляти елементи у зворотньому порядку
for i in min_index:  # проходимо по індексам у зміненому списку index
    del A[i], B[i]   # видаляємо елементи з A та B за відповідним індексом

print('Видаляємо інформацію про працівників, зарплата яких мінімальна:')
for i in range(len(A)):     # виводимо відповідні значення з A(прізвище) та B(заробітня плата)
    print(f'{A[i]} - {B[i]}')
