'''
Відомість на зарплату представлена як дві таблиці. Одна містить прізвища працівників цеху,
а друга - їх зарплату за поточний місяць. Знайдіть прізвище працівника, зарплата якого найменш відхиляється від
середньої зарплати всіх працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою заробітною
платою. Видаліть з відомості на зарплату відомості про працівника,зарплата якого мінімальна.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
import math     # імпортуємо бібліотеку math для роботи з математичними функціями
A = np.array(['Матеуш', 'Довгань', 'Попова', 'Цвігун', 'Луценко', 'Гнатюк', 'Гаєвська', 'Скакун', 'Шмиганівський', 'Гук'])
B = np.array([8400, 4500, 5600, 5900, 5300, 7100, 4500, 6900, 5900, 5400])
for i in range(len(A)):     # виводимо відповідні значення з масиву A(прізвище) та масиву B(заробітня плата)
    print(f'{A[i]} - {B[i]}')
# least_val - записується найменше відхилення (модуль числа math.fabs()) від середнього значення (np.mean())
# least_ind - змінна, в яку записується індекс значення least_val
least_val, least_ind = math.fabs(B.mean() - B[0]), 0
min_index = []     # створюємо пустий список, куди будемо записувати індекси елементів (мінімальна заробітна плата)
# змінні max_1 та max_2, куди будуть записуватися індекси двох максимальних чисел
max_1, max_2 = 0, 1
for i in range(10):  # циклічно обходимо всі елементи масиву B
    if math.fabs(B.mean(0) - B[i]) < least_val:  # визначаємо найменше відхилення зарплати від середнього значення
        least_val = math.fabs(B.mean() - B[i])
        least_ind = i

    if B[i] == min(B):  # визначаємо індекси мінімальних значень та записуємо їх у список, щоб потім видалити їх
        min_index.append(i)

    if i > 1:   # обходимо всі елементи крім нульового та першого
        if B[i] > B[max_1]:   # визначаємо два максимальних значення зарплати
            max_1 = i
        elif B[i] > B[max_2]:
            max_2 = i
print(f'\nЗарплата працівника {A[least_ind]} найменше відхиляється від середньої зарплати всіх працівників за поточний місяць')
print(f'Працівники з найбільшою заробітньою платою: {A[max_1]}, {A[max_2]}')

# вводимо змінну k, яка буде визначати на який інтервал перезаписувати елементи
# вводимо змінну flag, щоб визначити, коли буде знайдено перший елемент, який повинен бути видалений
k, flag = 1, False
# видаляємо інформацію про тих працівників, у кого мінімальна заробітна плата
for i in range(len(A) - len(min_index)):   # циклічно обходимо ту кількість елементів, які повинні залишитися у масиві
    if i in min_index:   # якщо знайдено елемент, який потрібно видалити
        while True:      # перевіряється який елемент потрібно перезаписати на це місце, що повинен залишитися у масиві
            if B[i] == B[i + k] or i + k in min_index:
                k += 1  # якщо наступний елемент теж повинен видалятися, то збільшуємо k а одинцю
            else:       # тобто збільшуємо інтервал перезаписування елементів
                break
        A[i], B[i] = A[i + k], B[i + k]   # виконуємо заміну у обох масивах
        flag = True    # змінюємо значення flag на True, що було здійснено перезапис елемента
# якщо елемент не потрібно видаляти, а принаймі один перезапис був здійснений, то перезапис виконується на відстань k
    elif flag:
        A[i], B[i] = A[i + k], B[i + k]   # виконуємо заміну у обох масивах
else:     # після закінчення циклу зменшуємо кількість елементів у масивах A та B на кількість видалених елементів
    A.resize(len(A) - len(min_index))
    B.resize(len(B) - len(min_index))

print('Видаляємо інформацію про працівників, зарплата яких мінімальна:')
for i in range(len(A)):     # виводимо відповідні значення з масиву A(прізвище) та масиву B(заробітня плата)
    print(f'{A[i]} - {B[i]}')
