'''
Дано одновимірний масив цілих чисел. Знайдіть, скільки разів в ньому повторюється найчастіше число.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = randint(10, 20)   # визначаємо рандомно розмір масиву в межах від 10 до 20
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 0 до 10
        A[i] = randint(0, 10)
    print(A)
    # у змінну unique записуємо масив, який складається з унікальних елементів масиву A
    # у змінну count записуємє масив, в якому згідно порядку в unique записано скільки кожен елемент зістрічається у A
    unique, count = np.unique(A, return_counts=True)
    # у змінні max_count та max_index будемо записувати найбільшу кількість повторень та його індекс
    max_count, max_index = 0, 0
    for i in range(len(count)):  # циклічно обходимо елементи масиву unique, щоб знайти максимальне число
        if count[i] > max_count:
            max_count = count[i]   # записуємо максимальне число повторень
            max_index = i     # записуємо індеск, щоб потім звернутися до маисву unique
    # виводимо число і кількість повторень
    print(f'Число {unique[max_index]} повторюється найбільшу кількість разів: {max_count}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break