'''
Дано одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних чисел в ньому.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = 10     # задаємо розмір матриці
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 0 до 10
        A[i] = randint(0, 10)
    print(A)
    # у змінну unique записуємо масив, який складається з унікальних елементів масиву A
    unique = np.unique(A)
    # щоб визначити кількість різних чисел, визначаємо довжину масиву unique (масиву унікальних значень)
    print(f'Кількість різних чисел у масиві: {len(unique)}')

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break