'''
Дано одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число однакових чисел, що йдуть підряд в ньому.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    N = 10     # задаємо розмір матриці
    A = np.zeros(N, dtype=int)  # ініціалізуємо масив нулями розміром N
    for i in range(N):  # циклічно заповнюємо масив випадковими числами в межах від 0 до 5
        A[i] = randint(0, 5)
    print(A)
    # вводимо змінну k, в яку будемо записувати кількість повторень
    # вводимо пустий список list, в якийбудемо записувати кількість повторень k
    k, list = 1, []
    for i in range(N - 1):  # циклінчо обходимо всі елементи масиву крім омтаннього
        if A[i] == A[i + 1]:  # якщо поточне число дорівнює наступному, збільшуємо k на одиницю
            k += 1
        else:   # якщо умова не виконується, то додаємо значення k в список і змінюємо k на одиницю
            list.append(k)
            k = 1
    # щоб знайти найбільше число однакових чисел, що йдуть підряд в ньому, знаходимо максимальне число в list
    # виводимо результат в залежності від max(list) (якщо max(list) = 1, то немає одинакових чисел підряд у масиві)
    print(f'Максимальна кількість одинакових чисел підряд: {max(list)}' if max(list) > 1 else
          'У масиві немає однакових чисел підряд')


    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break