'''
Створіть масив А [1..12] за допомогою генератора випадкових чисел з елементами від -20 до 10 і виведіть його на екран.
Замініть всі від’ємні елементи масиву числом 0.
Огороднік Марина Олександрівна, І курс, група 122А
'''
import numpy as np     # імпортуємо бібліотеку numpy для роботи з масивами
from random import randint     # імпортуємо функцію randint() для генерування випадкових чисел
while True:
    A = np.zeros(12, dtype=int)  # ініціалізуємо одновимірний масив нулями розміром 12
    for i in range(12):  # циклічно заповнюємо масив випадковими числами в межах від -20 до 10
        A[i] = randint(-20, 10)
    print(A)
    for i in range(12):  # циклічно перевіряємо всі елементи масиву
        if A[i] < 0:  # якщо знайдено від'ємний елемент, то замінюємо його на нуль
            A[i] = 0
    print(A)

    answer = input('Бажаєте запустити ще раз (+) чи за завершити програму (будь-що)? ')
    if answer == '+':
        print('')
        continue
    else:
        break
